
## :x: Apply Failed

[CI link](https://github.com/kanade0404/private-infra/actions/runs/7074823404)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/kaNade/private-infra/runs/run-LEyvr5eJ3UcZb2xL

Waiting for the plan to start...

Terraform v1.6.5
on linux_amd64
Initializing plugins and modules...
google_service_account.github-actions: Refreshing state... [id=projects/kanade0404/serviceAccounts/github-actions@kanade0404.iam.gserviceaccount.com]
google_project_service.service["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=kanade0404/cloudresourcemanager.googleapis.com]
google_project_service.service["firebaserules.googleapis.com"]: Refreshing state... [id=kanade0404/firebaserules.googleapis.com]
google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=kanade0404/iam.googleapis.com]
google_project_service.service["cloudfunctions.googleapis.com"]: Refreshing state... [id=kanade0404/cloudfunctions.googleapis.com]
google_project_service.service["integrations.googleapis.com"]: Refreshing state... [id=kanade0404/integrations.googleapis.com]
google_project_service.service["firestore.googleapis.com"]: Refreshing state... [id=kanade0404/firestore.googleapis.com]
google_project_service.service["cloudtrace.googleapis.com"]: Refreshing state... [id=kanade0404/cloudtrace.googleapis.com]
google_project_service.service["monitoring.googleapis.com"]: Refreshing state... [id=kanade0404/monitoring.googleapis.com]
google_project_service.service["bigquerystorage.googleapis.com"]: Refreshing state... [id=kanade0404/bigquerystorage.googleapis.com]
google_project_service.service["cloudkms.googleapis.com"]: Refreshing state... [id=kanade0404/cloudkms.googleapis.com]
google_project_service.service["connectors.googleapis.com"]: Refreshing state... [id=kanade0404/connectors.googleapis.com]
google_project_service.service["run.googleapis.com"]: Refreshing state... [id=kanade0404/run.googleapis.com]
google_project_service.service["serviceusage.googleapis.com"]: Refreshing state... [id=kanade0404/serviceusage.googleapis.com]
google_project_service.service["servicemanagement.googleapis.com"]: Refreshing state... [id=kanade0404/servicemanagement.googleapis.com]
google_project_service.service["sql-component.googleapis.com"]: Refreshing state... [id=kanade0404/sql-component.googleapis.com]
google_project_service.service["storage.googleapis.com"]: Refreshing state... [id=kanade0404/storage.googleapis.com]
google_project_service.service["iamcredentials.googleapis.com"]: Refreshing state... [id=kanade0404/iamcredentials.googleapis.com]
google_project_service.service["datastore.googleapis.com"]: Refreshing state... [id=kanade0404/datastore.googleapis.com]
google_project_service.service["cloudbuild.googleapis.com"]: Refreshing state... [id=kanade0404/cloudbuild.googleapis.com]
google_project_service.service["cloudapis.googleapis.com"]: Refreshing state... [id=kanade0404/cloudapis.googleapis.com]
google_project_service.service["logging.googleapis.com"]: Refreshing state... [id=kanade0404/logging.googleapis.com]
google_project_service.service["bigquery.googleapis.com"]: Refreshing state... [id=kanade0404/bigquery.googleapis.com]
google_project_service.service["storage-api.googleapis.com"]: Refreshing state... [id=kanade0404/storage-api.googleapis.com]
google_project_service.service["pubsub.googleapis.com"]: Refreshing state... [id=kanade0404/pubsub.googleapis.com]
google_project_service.service["sts.googleapis.com"]: Refreshing state... [id=kanade0404/sts.googleapis.com]
google_project_service.service["storage-component.googleapis.com"]: Refreshing state... [id=kanade0404/storage-component.googleapis.com]
google_project_service.service["secretmanager.googleapis.com"]: Refreshing state... [id=kanade0404/secretmanager.googleapis.com]
google_project_service.service["appengine.googleapis.com"]: Refreshing state... [id=kanade0404/appengine.googleapis.com]
google_app_engine_application.firestore: Refreshing state... [id=kanade0404]
google_kms_key_ring.infra: Refreshing state... [id=projects/kanade0404/locations/asia-northeast1/keyRings/infra]
google_iam_workload_identity_pool.github-actions: Refreshing state... [id=projects/kanade0404/locations/global/workloadIdentityPools/gh-oidc-pool]
google_service_account_iam_member.admin-account-iam["kanade0404/private-infra"]: Refreshing state... [id=projects/kanade0404/serviceAccounts/github-actions@kanade0404.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/137094135185/locations/global/workloadIdentityPools/gh-oidc-pool/attribute.repository/kanade0404/private-infra]
google_iam_workload_identity_pool_provider.github-actions: Refreshing state... [id=projects/kanade0404/locations/global/workloadIdentityPools/gh-oidc-pool/providers/github-actions]
google_service_account_iam_member.admin-account-iam["kanade0404/ur"]: Refreshing state... [id=projects/kanade0404/serviceAccounts/github-actions@kanade0404.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/137094135185/locations/global/workloadIdentityPools/gh-oidc-pool/attribute.repository/kanade0404/ur]
google_service_account_iam_member.admin-account-iam["kanade0404/scraping-zenn"]: Refreshing state... [id=projects/kanade0404/serviceAccounts/github-actions@kanade0404.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/137094135185/locations/global/workloadIdentityPools/gh-oidc-pool/attribute.repository/kanade0404/scraping-zenn]
google_kms_crypto_key.infra: Refreshing state... [id=projects/kanade0404/locations/asia-northeast1/keyRings/infra/cryptoKeys/infra]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.tfstate will be created
  + resource "google_storage_bucket" "tfstate" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # google_storage_bucket_object.tfstate_directory["zaim"] will be created
  + resource "google_storage_bucket_object" "tfstate_directory" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "zaim"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/zaim"
      + storage_class  = (known after apply)
    }

  # random_uuid.uuid will be created
  + resource "random_uuid" "uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 7 estimated
           $0.0/mo +$0.0

------------------------------------------------------------------------

random_uuid.uuid: Creating...
random_uuid.uuid: Creation complete after 0s [id=070dc2e4-a61e-e22d-2010-d15e23acf81d]
google_storage_bucket.tfstate: Creating...
google_storage_bucket.tfstate: Creation complete after 3s [id=tfstate-kanade0404-070dc2e4-a61e-e22d-2010-d15e23acf81d]
google_storage_bucket_object.tfstate_directory["zaim"]: Creating...
╷
│ Error: open /zaim: no such file or directory
│ 
│   with google_storage_bucket_object.tfstate_directory["zaim"],
│   on gcs.tf line 13, in resource "google_storage_bucket_object" "tfstate_directory":
│   13: resource "google_storage_bucket_object" "tfstate_directory" {
│ 
╵
Operation failed: failed running terraform apply (exit 1)
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":240,"Program":"tfcmt","SHA1":"f6f6f4199c1222a1011a9ef0a482b1c90c551458","Vars":{},"WorkflowName":"Terraform"} -->